-- Скрипт для наполнения тестовыми данными
-- Наполнения для НОВОЙ ЧИСТОЙ схемы
-- не после миграции

-- Воинские звания
INSERT INTO military_ranks (id, title)
VALUES (1, 'Рядовой'),
    (2, 'Сержант'),
    (3, 'Лейтенант'),
    (4, 'Капитан')
ON CONFLICT DO NOTHING;

-- Сотрудники
INSERT INTO employees (id, name, surname, rank_id)
VALUES (1, 'Иван', 'Иванов', 1),
    (2, 'Петр', 'Петров', 2),
    (3, 'Алексей', 'Сидоров', 3),
    (4, 'Иван', 'Смирнов', 1)
ON CONFLICT DO NOTHING;

-- Оборудование
INSERT INTO equipment_types (id, title, abbreviation)
VALUES (1, 'Десантный метеокомплект', 'ДМК'),
    (2, 'Ветровое ружье', 'ВР')
ON CONFLICT DO NOTHING;

-- Типы параметров
INSERT INTO parameter_types (id, title)
VALUES (1, 'Высота метеопоста'),
    (2, 'Температура'),
    (3, 'Давление'),
    (4, 'Направление ветра'),
    (5, 'Скорость ветра'),
    (6, 'Дальность сноса пуль')
ON CONFLICT DO NOTHING;

-- Единицы измерения
INSERT INTO units (id, title, abbreviation)
VALUES (1, 'Метр', 'м'),
    (2, '1/10 градуса по Цельсию', '*C/10'),
    (3, 'Миллиметр ртутного столба', 'мм рт. ст.'),
    (4, 'Деление угломера', 'дел. угл.'),
    (5, 'Метр в секунду', 'м/с'),
    (6, 'Градус по Цельсию', '*C')
ON CONFLICT DO NOTHING;

-- Связка параметров и единиц измерения
INSERT INTO parameters (id, parameter_type_id, unit_id, default_value, min_value, max_value)
VALUES (1, 1, 1, 100, NULL, NULL),
    (2, 2, 2, 150, -580, 580), -- десятые градуса
    (3, 3, 3, 750, 500, 900),
    (4, 4, 4, 0, 0, 59),
    (5, 5, 5, 0, 0, 15),
    (6, 6, 1, 0, 0, 150)
ON CONFLICT DO NOTHING;

-- Правила конвертации единиц
INSERT INTO unit_conversions (from_unit_id, to_unit_id, from_value, to_value)
VALUES (2, 6, 10, 1) -- 1/10 градуса = 1 целый градус
ON CONFLICT DO NOTHING;


-- Вставка самих измерений
-- Пачки измерений
INSERT INTO measurements_buckets (id, employee_id)
VALUES (1, 1), -- Сотрудник 1
    (2, 3), -- Сотрудник 3
    (3, 4) -- Сотрудник 4
ON CONFLICT DO NOTHING;

-- Измерения
INSERT INTO measurements (
    measurements_bucket_id, 
    equipment_type_id, 
    parameter_id, 
    value
)
VALUES
    -- Пачка 1 (ДМК, сотрудник 1)
    (1, 1, 1, 101), -- Высота: 101 м
    (1, 1, 2, 224), -- Температура: 22.4 *C (224 десятых)
    (1, 1, 3, 762), -- Давление: 762 мм рт. ст.
    (1, 1, 4, 55), -- Направление ветра: 55 дел. угл.
    (1, 1, 5, 8), -- Скорость ветра: 8 м/с
    -- Пачка 2 (ДМК, сотрудник 3)
    (2, 1, 1, 105), -- Высота: 105 м
    (2, 1, 2, 221), -- Температура: 22.1 *C (221 десятая)
    (2, 1, 3, 734), -- Давление: 734 мм рт. ст.
    (2, 1, 4, 12), -- Направление ветра: 12 дел. угл.
    (2, 1, 5, 3), -- Скорость ветра: 3 м/с
    -- Пачка 3 (Ветровое ружье, сотрудник 4)
    (3, 2, 1, 160), -- Высота: 160 м
    (3, 2, 2, -100),-- Температура: -10.0 *C (-100 десятых)
    (3, 2, 3, 670), -- Давление: 670 мм рт. ст.
    (3, 2, 4, 12), -- Направление ветра: 12 дел. угл.
    (3, 2, 6, 72); -- Дальность сноса пуль: 72 м